name: "iris_classifier"
backend: "onnxruntime"
max_batch_size: 64

input [
  {
    name: "float_input"
    data_type: TYPE_FP32
    dims: [4]
  }
]

output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [1]
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [3]
  }
]

instance_group [
  {
    kind: KIND_CPU
    count: 1
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 100
}
